## creating a new database and making it available

In [ ]:
DROP DATABASE IF EXISTS employees;
CREATE DATABASE IF NOT EXISTS employees; 
USE employees;

## creating tables

In [ ]:
CREATE TABLE sales.customers                                                    

(  

    customer_id INT,  

    first_name varchar(255),  

    last_name varchar(255),  

    email_address varchar(255),   

    number_of_complaints int,   

primary key (customer_id),

);  

   

CREATE TABLE sales.items                                                                                                                              

(  

    item_code varchar(255),   

    item varchar(255),   

    unit_price numeric(10,2),   

    company_id varchar(255),

primary key (item_code)   

);  

    CREATE TABLE sales.companies   

(

    company_id varchar(255),   

    company_name varchar(255),  

    headquarters_phone_number int(12),   

primary key (company_id)   

);


 CREATE TABLE sales.sales   

(

    purchase_number varchar(255),   

    date_of_purchase varchar(255),  

    customer_id int,   
    
    item_code varchar(255),

primary key (purchase_number)   

);

In [ ]:
create table if not exists test(numbers int(10), words varchar(10));

In [ ]:
use sales;  ## using sales schema for operationalization

## deleting a table

In [ ]:
DROP TABLE sales;

## Adding and dropping foreign key

In [ ]:
CREATE TABLE sales.sales   

(

    purchase_number varchar(255),   

    date_of_purchase varchar(255),  

    customer_id varchar(255),   
    
    item_code varchar(255),

primary key (purchase_number)
);

ALTER TABLE sales.sales
ADD FOREIGN KEY (customer_id) REFERENCES customers(customer_id) ON DELETE CASCADE;

## the name of column is learned from DDL tab 
ALTER TABLE sales
DROP foreign key sales_ibfk_1;

## adding a unique key and revoking the index characteristic

In [ ]:
ALTER TABLE sales.customers 
ADD UNIQUE KEY (email_address);

ALTER TABLE sales.customers
DROP INDEX email_address;

## adding new column

In [ ]:
ALTER TABLE customers

ADD COLUMN gender ENUM('M', 'F') AFTER last_name;

## inserting data to an existing columns

In [ ]:
INSERT INTO customers (first_name, last_name, gender, email_address, number_of_complaints)

VALUES ('John', 'Mackinley', 'M', 'john.mckinley@365careers.com', 0)

## assigning default value to columns

In [ ]:
ALTER TABLE customers
CHANGE COLUMN number_of_complaints number_of_complaints INT DEFAULT 0;

INSERT INTO customers (first_name, last_name, gender)
VALUES ('Peter', 'Figaro', 'M');

## viewing the table

In [ ]:
SELECT * FROM customers;

## dropping the default value

In [ ]:
ALTER TABLE customers
ALTER COLUMN number_of_complaints DROP DEFAULT;

## adding non value (not null) feature to a column when creating a table

In [ ]:
CREATE TABLE companies

(

    company_id VARCHAR(255),

    company_name VARCHAR(255) NOT NULL, ####

    headquarters_phone_number VARCHAR(255),

PRIMARY KEY (company_id)

);

## deleting non value feature from a column

In [ ]:
ALTER TABLE companies
MODIFY company_name VARCHAR(255) NULL;

## adding non value feature to an existing table

In [ ]:
ALTER TABLE companies
CHANGE COLUMN company_name company_name VARCHAR(255) NOT NULL;

## commenting

In [ ]:
for large comments

/* 
Comment 1
Comment 2
*/


for one-line comments 

# or --

## select

In [ ]:
use employees;
SELECT 
    first_name, last_name
FROM
    employees;
    
    
SELECT 
    *
FROM
    employees;
    
    
SELECT 
    dept_no
FROM
    departments;
    
    
SELECT 
    *
FROM
    departments;
    
    
SELECT 
    *
FROM
    employees
WHERE 
	first_name = 'Denis';

In [ ]:
SELECT 
    *
FROM
    employees
WHERE 
	first_name = 'Denis' and gender = 'M';

In [ ]:
SELECT

    *

FROM

    employees

WHERE

    first_name = 'Kellie' AND gender = 'F';

In [ ]:
SELECT 
    *
FROM
    employees
WHERE 
	first_name = 'Denis' or first_name = 'Elvis';

### SQL operates first AND and then OR if both are conditioned in the same WHERE

In [ ]:
SELECT 
    *
FROM
    employees
WHERE
    last_name = 'Denis'
        AND (gender = 'M' OR gender = 'F');

In [ ]:
SELECT 
    *
FROM
    employees
WHERE
    gender = 'F'
        AND (first_name = 'Kellie'
        OR first_name = 'Aruna');

In [ ]:
SELECT 
    *
FROM
    employees
WHERE
    first_name = 'Cathie'
        OR (first_name = 'Mark'
        OR first_name = 'Nathan');

### another more efficient way to do this query

In [ ]:
SELECT 
    *
FROM
    employees
WHERE
    first_name IN ('Cathie', 'Mark', 'Nathan');

In [ ]:
SELECT 
    *
FROM
    employees
WHERE
    first_name NOT IN ('Cathie', 'Mark', 'Nathan');

In [ ]:
# Use the IN operator to select all individuals from the “employees” table, whose first name is either “Denis”, or “Elvis”.

SELECT

    *

FROM

    employees

WHERE

    first_name IN ('Denis' , 'Elvis');

In [ ]:
## Extract all records from the ‘employees’ table, aside from those with employees named John, Mark, or Jacob.

SELECT

    *

FROM

    employees

WHERE

    first_name NOT IN ('John' , 'Mark', 'Jacob');

In [ ]:
# Working with the “employees” table, use the LIKE operator to select the data about all individuals, whose first name starts with “Mark”; specify that the name can be succeeded by any sequence of characters.

# Retrieve a list with all employees who have been hired in the year 2000.

# Retrieve a list with all employees whose employee number is written with 5 characters, and starts with “1000”. 

SELECT

    *

FROM

    employees

WHERE

    first_name LIKE('Mark%');

 

SELECT

    *

FROM

    employees

WHERE

    hire_date LIKE ('%2000%');

 

SELECT

    *

FROM

    employees

WHERE

    emp_no LIKE ('1000_');

In [ ]:
# Extract all individuals from the ‘employees’ table whose first name contains “Jack”.

# Once you have done that, extract another list containing the names of employees that do not contain “Jack”.

SELECT

    *

FROM

    employees

WHERE

    first_name LIKE ('%JACK%');

SELECT

    *

FROM

    employees

WHERE

    first_name NOT LIKE ('%Jack%');

### BETWEEN - AND - exercise
Select all the information from the “salaries” table regarding contracts from 66,000 to 70,000 dollars per year.

Retrieve a list with all individuals whose employee number is not between ‘10004’ and ‘10012’.

Select the names of all departments with numbers between ‘d003’ and ‘d006’.

In [ ]:
SELECT

    *

FROM

    salaries;

 

SELECT

    *

FROM

    salaries

WHERE

    salary BETWEEN 66000 AND 70000

    ;

   

SELECT

    *

FROM

    employees

WHERE

    emp_no NOT BETWEEN '10004' AND '10012'

    ;

   

SELECT

    dept_name

FROM

    departments

WHERE

    dept_no BETWEEN 'd003' AND 'd006';

In [ ]:
# Select the names of all departments whose department number value is not null.

SELECT

    dept_name

FROM

    departments

WHERE

    dept_no IS NOT NULL;

In [ ]:
# Retrieve a list with data about all female employees who were hired in the year 2000 or after.

# Hint: If you solve the task correctly, SQL should return 7 rows.

# Extract a list with all employees’ salaries higher than $150,000 per annum.

SELECT

    *

FROM

    employees

WHERE

    hire_date >= '2000-01-01'

        AND gender = 'F';

SELECT

    *

FROM

    salaries

WHERE

    salary > 150000;

## SELECT DISTINCT

In [ ]:
# Obtain a list with all different “hire dates” from the “employees” table.

# Expand this list and click on “Limit to 1000 rows”. This way you will set the limit of output rows displayed back to the default of 1000.

# In the next lecture, we will show you how to manipulate the limit rows count. 


SELECT DISTINCT

    hire_date

FROM

    employees;

## Aggregate functions (count etc.)

In [ ]:
SELECT 
    COUNT(first_name)
FROM
    employees;
    
    SELECT 
    COUNT(DISTINCT first_name) ## note that DISTINCT is written before first_name (which we want to differentiate), but not from SELECT
FROM
    employees;

In [ ]:
# How many annual contracts with a value higher than or equal to $100,000 have been registered in the salaries table?


SELECT 
    COUNT(*)
FROM
    salaries
WHERE
    salary >= 100000;
    
# How many managers do we have in the “employees” database? Use the star symbol (*) in your code to solve this exercise.

    
SELECT 
    COUNT(*)
FROM
    dept_manager;

### order by

In [ ]:
SELECT 
    *
FROM
    employees
ORDER BY first_name;



SELECT 
    *
FROM
    employees
ORDER BY first_name DESC;



SELECT 
    *
FROM
    employees
ORDER BY first_name DESC, last_name DESC;

In [ ]:
# Select all data from the “employees” table, ordering it by “hire date” in descending order.

SELECT

    *

FROM

    employees

ORDER BY hire_date DESC;

### Group by

In [ ]:
SELECT 
    COUNT(first_name)
FROM
    employees
GROUP BY first_name;



SELECT 
    first_name, COUNT(first_name) ## adds first name before the count of which 
FROM
    employees
GROUP BY first_name;



SELECT 
    first_name, COUNT(first_name)
FROM
    employees
GROUP BY first_name
ORDER BY first_name DESC; ## orders them by first name in the reverse order



SELECT 
    first_name, COUNT(first_name) AS names_count ## names the new column as 'names_count'
FROM
    employees
GROUP BY first_name
ORDER BY first_name DESC;

In [ ]:
# Write a query that obtains two columns. 
# The first column must contain annual salaries higher than 80,000 dollars. 
# The second column, renamed to “emps_with_same_salary”, must show the number of employees contracted to that salary. 
# Lastly, sort the output by the first column.

SELECT

    salary, COUNT(emp_no) AS emps_with_same_salary

FROM

    salaries

WHERE

    salary > 80000

GROUP BY salary

ORDER BY salary;

## having

**where** and **having** are the same actually, but where cannot be used before aggreagate functionss, but having can be used

In [ ]:
# Select all employees whose average salary is higher than $120,000 per annum.

SELECT

    emp_no, AVG(salary)

FROM

    salaries

GROUP BY emp_no

HAVING AVG(salary) > 120000  ## located between GROUP BY and ORDER BY commands

ORDER BY emp_no;

### where vs. having

In [ ]:
SELECT 
    first_name, COUNT(first_name) AS names_count
FROM
    employees
WHERE
    hire > '1999-01-01'
GROUP BY first_name
HAVING COUNT(first_name) < 200
ORDER BY first_name DESC;

In [ ]:
# Select the employee numbers of all individuals who have signed more than 1 contract after the 1st of January 2000.

SELECT

    emp_no

FROM

    dept_emp

WHERE  ## note that both where and having are used 

    from_date > '2000-01-01'

GROUP BY emp_no

HAVING COUNT(from_date) > 1

ORDER BY emp_no;

## Limit

In [ ]:
# Select the first 100 rows from the ‘dept_emp’ table. 

SELECT

    *

FROM

    dept_emp

LIMIT 100;

## Insert statement

In [ ]:
SELECT 
    *
FROM
    employees
LIMIT 10;   ### functions as head() in python



## we need to specify as many data values as there are columns in the data table
## and add them in the same order in which they appear in the table
INSERT INTO employees
(
        emp_no,
        birth_date,
        first_name, 
        last_name,
        gender, 
        hire_date
)    VALUES
(
        999901,
        '1986-02-21', 
        'John', 
        'Smith', 
        'M', 
        '2011-01-01'
);

In [ ]:
## Select ten records from the “titles” table to get a better idea about its content.
# Then, in the same table, insert information about employee number 999903. State that he/she is a “Senior Engineer”, who has started working in this position on October 1st, 1997.
# At the end, sort the records from the “titles” table in descending order to check if you have successfully inserted the new record.


SELECT

    *

FROM

    titles

LIMIT 10;

 

insert into titles

(

	emp_no,

    title,

    from_date

)

values

(

	999903,

    'Senior Engineer',

    '1997-10-01'

);

 

SELECT 
    *
FROM
    titles
ORDER BY emp_no DESC;

In [ ]:
# Insert information about the individual with employee number 999903 into the “dept_emp” table. He/She is working for department number 5, and has started work on  October 1st, 1997; her/his contract is for an indefinite period of time.

## Hint: Use the date ‘9999-01-01’ to designate the contract is for an indefinite period.


SELECT 
    *
FROM
    dept_emp
ORDER BY emp_no DESC
LIMIT 10;

 

insert into dept_emp

(

	emp_no,

    dept_no,

    from_date,

    to_date

)

values

(

	999903,

    'd005',

    '1997-10-01',

    '9999-01-01'

);

In [ ]:
# Create a new department called “Business Analysis”. Register it under number ‘d010’.
## Hint: To solve this exercise, use the “departments” table.

INSERT INTO departments VALUES ('d010', 'Business Analysis');

In [ ]:
# Inserting data into a new table

CREATE TABLE departments_dup (
    dept_no CHAR(4) NOT NULL,
    dept_name VARCHAR(40) NOT NULL
);


SELECT 
    *
FROM
    departments_dup; ## empty

    
insert into departments_dup
(
    dept_no
    dept_name
)

Select * from departments;

## UPDATE statement

In [ ]:
use employees;

# first we look at the existing record 
SELECT 
    *
FROM
    employees
WHERE
    emp_no = 9999901;


    
# changing a record an existing record of emp_no
    
UPDATE employees 
SET 
    first_name = 'Stella',
    last_name = 'Parkinson',
    birth_date = '1990-12-31',
    gender = 'F'
WHERE
    emp_no = 999901;
    
    
# finally we observe the change 
SELECT 
    *
FROM
    employees
WHERE
    emp_no = 9999901;

## commit and rollback

In [ ]:
SELECT 
    *
FROM
    departments_dup
ORDER BY dept_no;

commit;

update departments_dup
set
dept_no = 'd011'
dept_name = 'Quality Control';

rollback;   ## Just undoes the most recent change. that's it.


commit;

In [ ]:
# Change the “Business Analysis” department name to “Data Analysis”.

## Hint: To solve this exercise, use the “departments” table.

UPDATE departments 
SET 
    dept_name = 'Data Analysis'
WHERE
    dept_name = 'Business Analysis';
    
    # or
    
    dept_no = 'd010';

## delete statement

In [ ]:
use employees;

commit; # before deleting we first commit

SELECT 
    *
FROM
    employees
WHERE
    emp_no = 9999903;
    

DELETE FROM employees  ## it also deletes the record of same personnel 'cascade delete'd from our tables
WHERE ## this is critical
    emp_no = 9999903;

In [ ]:
## Remove the department number 10 record from the “departments” table.

DELETE FROM departments

WHERE

    dept_no = 'd010';

### drop vs. truncate vs. delete

In [ ]:
# once you drop a table, it's gone (to the last commit statement)
# truncate is like delete without where clause
# delete removes row by row

## Aggregate Functions 

### count, sum, min, max, avg

### count()

In [ ]:
SELECT 
    *
FROM
    salaries
ORDER BY salary DESC
LIMIT 10;

SELECT 
    COUNT(salary)
FROM
    salaries;

SELECT 
    COUNT(DISTINCT salary)
FROM
    salaries;

SELECT 
    COUNT(*) # this includes null values
FROM
    salaries;

In [ ]:
# How many departments are there in the “employees” database? Use the ‘dept_emp’ table to answer the question.

SELECT

    COUNT(DISTINCT dept_no)

FROM

    dept_emp;

### sum()

In [ ]:
SELECT 
    SUM(salary)
FROM
    salaries;

In [ ]:
# What is the total amount of money spent on salaries for all contracts starting after the 1st of January 1997?

SELECT

    SUM(salary)

FROM

    salaries

WHERE

    from_date > '1997-01-01';

### min() and max()

In [ ]:
# which is the highest salary we offer?

SELECT 
    MAX(salary)
FROM
    salaries;

SELECT 
    MIN(salary)
FROM
    salaries;

In [ ]:
# 1. Which is the lowest employee number in the database?

# 2. Which is the highest employee number in the database?

In [ ]:
#1

SELECT

    MIN(emp_no)

FROM

    employees;

#2

SELECT

    MAX(emp_no)

FROM

    employees;

### avg()

In [ ]:
SELECT 
    AVG(salary)
FROM
    salaries;

In [ ]:
# What is the average annual salary paid to employees who started after the 1st of January 1997?

SELECT

    AVG(salary)

FROM

    salaries

WHERE

    from_date > '1997-01-01';

### round()

In [ ]:
SELECT 
    ROUND(AVG(salary),2) # decimal points 
FROM
    salaries;

In [ ]:
SELECT 
    ROUND(AVG(salary))
FROM
    salaries;

In [ ]:
# Round the average amount of money spent on salaries for all contracts that started after the 1st of January 1997 to a precision of cents.

SELECT

    ROUND(AVG(salary), 2)

FROM

    salaries

WHERE

    from_date > '1997-01-01';

### ifnull() and coalesce()

use coalesce, but not ifnull

In [ ]:
select 
    dept_no
ifnull(dept_name, 'Department name not provided')
from departments_dup;

In [ ]:
select 
    dept_no
ifnull(dept_name, 'Department name not provided') as dept_name ## this also names the column
from departments_dup;

In [ ]:
select 
    dept_no
coalesce(dept_name, 'Department name not provided') as dept_name ## coalesce is the same as ifnull even with single and multiple (more than two) parameters in the paranthesis 
from departments_dup;

In [ ]:
## fill the null values in the dept_manager column with dept_name(the second parameter). and if dept_name is missing than put 'N/A' for the dept_manager column. 

select 
    dept_no
    coalesce(dept_manager, dept_name, 'N/A') as dept_manager 
from 
    departments_dup

order by dept_no ASC;

In [ ]:
# Select the department number and name from the ‘departments_dup’ table and add a third column where you name the department number (‘dept_no’) as ‘dept_info’. If ‘dept_no’ does not have a value, use ‘dept_name’.

SELECT

    dept_no,

    dept_name,

    COALESCE(dept_no, dept_name) AS dept_info

FROM

    departments_dup

ORDER BY dept_no ASC;

In [ ]:
# Modify the code obtained from the previous exercise in the following way. Apply the IFNULL() function to the values from the first and second column, so that ‘N/A’ is displayed whenever a department number has no value, and ‘Department name not provided’ is shown if there is no value for ‘dept_name’.

SELECT

    IFNULL(dept_no, 'N/A') AS dept_info,
    
    IFNULL(dept_name, 'Department name not provided') AS dept_name,
    
    COALESCE(dept_no, dept_name) AS dept_info

FROM

    departments_dup

ORDER BY dept_no ASC;

In [ ]:
# If you currently have the ‘departments_dup’ table set up, use DROP COLUMN to remove the ‘dept_manager’ column from the ‘departments_dup’ table.
# Then, use CHANGE COLUMN to change the ‘dept_no’ and ‘dept_name’ columns to NULL.
# (If you don’t currently have the ‘departments_dup’ table set up, create it. Let it contain two columns: dept_no and dept_name. Let the data type of dept_no be CHAR of 4, and the data type of dept_name be VARCHAR of 40. Both columns are allowed to have null values. Finally, insert the information contained in ‘departments’ into ‘departments_dup’.)
# Then, insert a record whose department name is “Public Relations”.
# Delete the record(s) related to department number two.
# Insert two new records in the “departments_dup” table. Let their values in the “dept_no” column be “d010” and “d011”.

# if you currently have ‘departments_dup’ set up:

ALTER TABLE departments_dup

DROP COLUMN dept_manager;

 

ALTER TABLE departments_dup

CHANGE COLUMN dept_no dept_no CHAR(4) NULL;

 

ALTER TABLE departments_dup

CHANGE COLUMN dept_name dept_name VARCHAR(40) NULL;

 

# if you don’t currently have ‘departments_dup’ set up

DROP TABLE IF EXISTS departments_dup;

CREATE TABLE departments_dup

(

    dept_no CHAR(4) NULL,

    dept_name VARCHAR(40) NULL

);

 

INSERT INTO departments_dup

(

    dept_no,

    dept_name

)SELECT

                *

FROM

                departments;

 

INSERT INTO departments_dup (dept_name)

VALUES                ('Public Relations');

 

DELETE FROM departments_dup

WHERE

    dept_no = 'd002'; 

   

INSERT INTO departments_dup(dept_no) VALUES ('d010'), ('d011');

# JOINS 

allows us to construct a relationship between objects

## inner join

extracts only matching (common) values in corresponding tables

In [ ]:
SELECT 
    m.dept_no, m.emp_no, d.dept_name ## these are the variables we're interested in for a new table (for example)
FROM
    dept_manager_dup m
        INNER JOIN
    departments_dup d ON m.dept_no = d.dept_no
GROUP BY m.emp_no
ORDER BY m.dept_no;

In [ ]:
# Extract a list containing information about all managers’ employee number, first and last name, department number, and hire date. 

SELECT 
    e.emp_no, e.first_name, e.last_name, dm.dept_no, e.hire_date
FROM
    employees e
        JOIN
    dept_manager dm ON e.emp_no = dm.emp_no;

In [2]:
# if you have duplicates in the data, make sure to GROUP BY that table when joining. That is, write command GROUP BY <table_name> before ORDER BY block

## left join

left join == left outer join

In [ ]:
## the alias for the first paramater in SELECT --d-- should match with the left table---d 


SELECT 
    m.dept_no, m.emp_no, d.dept_name 
FROM
    dept_manager_dup m
        LEFT JOIN
    departments_dup d ON m.dept_no = d.dept_no
ORDER BY dept_no;

In [ ]:
# Join the 'employees' and the 'dept_manager' tables to return a subset of all the employees whose last name is Markovitch. See if the output contains a manager with that name.  

## Hint: Create an output containing information corresponding to the following fields: ‘emp_no’, ‘first_name’, ‘last_name’, ‘dept_no’, ‘from_date’. Order by 'dept_no' descending, and then by 'emp_no'.

SELECT 
    e.emp_no,
    e.first_name,
    e.last_name,
    dm.dept_no,
    dm.from_date
FROM
    employees e
        LEFT JOIN
    dept_manager dm ON e.emp_no = dm.emp_no
WHERE
    e.last_name = 'Markovitch'
ORDER BY dm.dept_no DESC , e.emp_no;

### right join

In [ ]:
SELECT 
    m.dept_no, m.emp_no, d.dept_name 
FROM
    dept_manager_dup m
        RIGHT JOIN
    departments_dup d ON m.dept_no = d.dept_no
ORDER BY d.dept_no;

### The new and the old join syntax - exercise

In [ ]:
# Extract a list containing information about all managers’ employee number, first and last name, department number, and hire date. Use the old type of join syntax to obtain the result.

SELECT 
    e.emp_no, e.first_name, e.last_name, dm.dept_no, e.hire_date
FROM
    employees e,
    dept_manager dm
WHERE
    e.emp_no = dm.emp_no;



## New Join Syntax:

SELECT

    e.emp_no, e.first_name, e.last_name, dm.dept_no, e.hire_date

FROM

    employees e

        JOIN

    dept_manager dm ON e.emp_no = dm.emp_no;

### Join and where used together

In [ ]:
SELECT 
    e.emp_no, e.first_name, e.last_name, s.salary
FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    s.salary > 145000
;

In [ ]:
# Select the first and last name, the hire date, and the job title of all employees whose first name is “Margareta” and have the last name “Markovitch”.

SELECT 
    e.first_name, e.last_name, e.hire_date, t.title
FROM
    employees e
        JOIN
    titles t ON e.emp_no = t.emp_no
WHERE
    first_name = 'Margareta'
        AND last_name = 'Markovitch'
ORDER BY e.emp_no
;

### cross join

In [ ]:
# Use a CROSS JOIN to return a list with all possible combinations between managers from the dept_manager table and department number 9.

SELECT 
    dm.*, d.*
FROM
    departments d
        CROSS JOIN
    dept_manager dm
WHERE
    d.dept_no = 'd009'
ORDER BY d.dept_name;

In [ ]:
# Return a list with the first 10 employees with all the departments they can be assigned to.

## Hint: Don’t use LIMIT; use a WHERE clause.

SELECT 
    e.*, d.*
FROM
    employees e
        CROSS JOIN
    departments d
WHERE
    e.emp_no < 10011
ORDER BY e.emp_no , d.dept_name;

### Using Aggregate functions with joins

In [ ]:
# find the average salaries of men and women in the company 

SELECT 
    e.gender, AVG(s.salary) AS average_salary
FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
GROUP BY gender;

#### joining more than two tables

In [ ]:
SELECT 
    e.first_name,
    e.last_name,
    e.hire_date,
    m.from_date,
    d.dept_name
FROM
    employees e
        JOIN
    dept_manager m ON e.emp_no = m.emp_no
        JOIN
    departments d ON m.dept_no = d.dept_no
;

In [3]:
# Select all managers’ first and last name, hire date, job title, start date, and department name.

SELECT 
    e.first_name,
    e.last_name,
    e.hire_date,
    t.title,
    d.from_date,
    dp.dept_name
FROM
    employees e
        JOIN
    titles t ON e.emp_no = t.emp_no
        JOIN
    dept_manager d ON e.emp_no = d.emp_no
        JOIN
    departments dp ON d.dept_no = dp.dept_no
WHERE
    t.title = 'Manager'
ORDER BY e.emp_no;
;

In [ ]:
# complete the dept_name and average_salary table where there is not direct relational link between two tables

SELECT 
    d.dept_name, AVG(salary) AS average_salary
FROM
    departments d
        JOIN
    dept_manager m ON d.dept_no = m.dept_no
        JOIN
    salaries s ON m.emp_no = s.emp_no
GROUP BY dept_name   ### you have to add these to get distinct values by dept
ORDER BY average_salary DESC
; 


### inserting HAVING as a conditional statement

SELECT 
    d.dept_name, AVG(salary) AS average_salary
FROM
    departments d
        JOIN
    dept_manager m ON d.dept_no = m.dept_no
        JOIN
    salaries s ON m.emp_no = s.emp_no
GROUP BY dept_name
HAVING average_salary > 60000
ORDER BY average_salary DESC
;

In [ ]:
# How many male and how many female managers do we have in the ‘employees’ database?
SELECT 
    e.gender, COUNT(dm.emp_no)
FROM
    employees e
        JOIN
    dept_manager dm ON e.emp_no = dm.emp_no
GROUP BY gender;

### union vs. union all

In [ ]:
What do you think is the meaning of the minus sign before subset A in the last row (ORDER BY -a.emp_no DESC)? 

SELECT 
    *
FROM
    (SELECT 
        e.emp_no,
            e.first_name,
            e.last_name,
            NULL AS dept_no,
            NULL AS from_date
    FROM
        employees e
    WHERE
        last_name = 'Denis' UNION SELECT 
        NULL AS emp_no,
            NULL AS first_name,
            NULL AS last_name,
            dm.dept_no,
            dm.from_date
    FROM
        dept_manager dm) AS a
ORDER BY - a.emp_no DESC;

## subqueries

In [ ]:
# Extract information about all first and last names of department managers

SELECT 
    e.first_name, e.last_name
FROM
    employees e
WHERE
    e.emp_no IN (SELECT 
            dm.emp_no
        FROM
            dept_manager dm);

In [ ]:
# Extract the information about all department managers who were hired between the 1st of January 1990 and the 1st of January 1995.
SELECT 
    *
FROM
    dept_manager
WHERE
    emp_no IN (SELECT 
            emp_no
        FROM
            employees
        WHERE
            hire_date BETWEEN '1990-01-01' AND '1995-01-01');

### subqueries with EXISTS-NOT EXISTS

***returns a boolean value***

In [ ]:
SELECT 
    e.first_name, e.last_name
FROM
    employees e
WHERE
    EXISTS( SELECT 
            *
        FROM
            dept_manager dm
        WHERE
            dm.emp_no = e.emp_no);

In [ ]:
SELECT 
    e.first_name, e.last_name
FROM
    employees e
WHERE
    EXISTS( SELECT 
            *
        FROM
            dept_manager dm
        WHERE
            dm.emp_no = e.emp_no)
ORDER BY emp_no; # Use order by out of subquery

In [ ]:
# Select the entire information for all employees whose job title is “Assistant Engineer”. 

# Hint: To solve this exercise, use the 'employees' table.

SELECT 
    *
FROM
    employees e
WHERE
    EXISTS( SELECT 
            *
        FROM
            titles t
        WHERE
            t.emp_no = e.emp_no
                AND title = 'Assistant Engineer');

In [ ]:
# Assign employee number 110022 as a manager to all employees from 10001 to 10020, 
## and employee number 110039 as a manager to all employees from 10021 to 10040
SELECT 
    A.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110022) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no <= 10020
    GROUP BY e.emp_no
    ORDER BY e.emp_no) AS A 
UNION SELECT 
    B.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110039) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no > 10020
    GROUP BY e.emp_no
    ORDER BY e.emp_no
    LIMIT 20) AS B;

In [ ]:
# Intro to the question below---Starting your code with “DROP TABLE”, create a table called “emp_manager” (emp_no – integer of 11, not null; dept_no – CHAR of 4, null; manager_no – integer of 11, not null). 

DROP TABLE if exists emp_manager;

CREATE TABLE emp_manager (
    emp_no INT(11) NOT NULL,
    dept_no CHAR(4) NULL,
    manager_no INT(11) NOT NULL
);

In [ ]:
# This is the question, solution is below cell.

Fill emp_manager with data about employees, the number of the department they are working in, and their managers.

Your query skeleton must be:

Insert INTO emp_manager SELECT

U.*

FROM

                 (A)

UNION (B) UNION (C) UNION (D) AS U;

A and B should be the same subsets used in the last lecture (SQL Subqueries Nested in SELECT and FROM). In other words, assign employee number 110022 as a manager to all employees from 10001 to 10020 (this must be subset A), and employee number 110039 as a manager to all employees from 10021 to 10040 (this must be subset B).

Use the structure of subset A to create subset C, where you must assign employee number 110039 as a manager to employee 110022.

Following the same logic, create subset D. Here you must do the opposite - assign employee 110022 as a manager to employee 110039.

Your output must contain 42 rows.

Good luck!

In [ ]:
SELECT 
    A.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110022) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no <= 10020
    GROUP BY e.emp_no
    ORDER BY e.emp_no) AS A 
UNION SELECT 
    B.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110039) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no > 10020
    GROUP BY e.emp_no
    ORDER BY e.emp_no
    LIMIT 20) AS B 
UNION SELECT 
    C.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110039) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no = 110022
    GROUP BY e.emp_no
    ORDER BY e.emp_no) AS C 
UNION SELECT 
    D.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110022) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no = 110039
    GROUP BY e.emp_no
    ORDER BY e.emp_no) AS D;

## Self join

In [ ]:
SELECT DISTINCT
    e1.*
FROM
    emp_manager e1
        JOIN
    emp_manager e2 ON e1.emp_no = e2.manager_no;

## View

In [ ]:
## Finding duplicates for emp_no 

SELECT 
    *
FROM
    dept_emp;
    

SELECT 
    emp_no, from_data, to_date, COUNT(emp_no) AS num
FROM
    dept_emp
GROUP BY emp_no
HAVING num > 1

In [ ]:
CREATE OR REPLACE VIEW v_dept_emp_latest_date AS
    SELECT 
        emp_no, MAX(from_date) AS from_date, MAX(to_date) AS to_date
    FROM
        dept_emp
    GROUP BY emp_no;

In [ ]:
# Create a view that will extract the average salary of all managers registered in the database. Round this value to the nearest cent.

# If you have worked correctly, after executing the view from the “Schemas” section in Workbench, you should obtain the value of 66924.27.

In [ ]:
CREATE OR REPLACE VIEW v_manager_avg_salary AS
    SELECT 
        ROUND(AVG(salary), 2)
    FROM
        salaries s
            JOIN
        dept_manager m ON s.emp_no = m.emp_no;

## Stored Routines

In [ ]:
USE employees;
DROP PROCEDURE IF EXISTS select_employees;

DELIMITER $$

CREATE PROCEDURE select_employees()
BEGIN

	SELECT * FROM employees
	LIMIT 1000; 

END$$

DELIMITER ;

In [ ]:
# invoking procedures

CALL employees.select_employees();

CALL select_employees();

CALL select_employees;

In [ ]:
# Create a procedure that will provide the average salary of all employees.

## Then, call the procedure.
USE employees;

DROP PROCEDURE IF EXISTS average_salary;

DELIMITER $$

CREATE PROCEDURE average_salary()

BEGIN

        SELECT 
            AVG(salary)
        FROM
            salaries;

END$$

DELIMITER ; 

CALL average_salary;

### procedure with parameters

In [ ]:
USE `employees`;
DROP procedure IF EXISTS emp_salary;

DELIMITER $$
CREATE PROCEDURE emp_salary (IN p_emp_no INTEGER)
BEGIN
SELECT 
    e.first_name, e.last_name, s.salary, s.from_date, s.to_date
FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.emp_no = p_emp_no;  ###p_emp_no --- designated in the paranthesis as parameter
END$$

DELIMITER ;

### stored procedure with an output parameter

In [ ]:
USE `employees`;
DROP procedure IF EXISTS emp_salary_out;

DELIMITER $$
CREATE PROCEDURE emp_salary(IN p_emp_no INTEGER, out p_avg_salary DECIMAL(10,2)) ## out is critical
BEGIN
SELECT 
    AVG(s.salary)
INTO p_avg_salary FROM  ## into is critical
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.emp_no = p_emp_no;  
END$$

DELIMITER ;

In [ ]:
# Create a procedure called ‘emp_info’ that uses as parameters the first and the last name of an individual, and returns their employee number.

DELIMITER $$

CREATE PROCEDURE emp_info(in p_first_name varchar(255), in p_last_name varchar(255), out p_emp_no integer)

BEGIN

SELECT 
    e.emp_no
INTO p_emp_no FROM
    employees e
WHERE
    e.first_name = p_first_name
        AND e.last_name = p_last_name;

END$$

DELIMITER ;

## Variables

In [ ]:
SET @v_avg_salary = 0;
CALL employees.emp_avg_salary_out(11300, @v_avg_salary); ## @v_avg_salary tells the procedure where the output will be used/stored
SELECT @v_avg_salary;

In [ ]:
# Create a variable, called ‘v_emp_no’, where you will store the output of the procedure you created in the last exercise.

# Call the same procedure, inserting the values ‘Aruna’ and ‘Journel’ as a first and last name respectively.

# Finally, select the obtained output.

SET @v_emp_no = 0;

CALL emp_info('Aruna', 'Journel', @v_emp_no);

SELECT @v_emp_no;

## User defined functions

In [ ]:
# Create a function called ‘emp_info’ that takes for parameters the first and last name of an employee, and returns the salary from the newest contract of that employee.

# Hint: In the BEGIN-END block of this program, you need to declare and use two variables – v_max_from_date that will be of the DATE type, and v_salary, that will be of the DECIMAL (10,2) type.

# Finally, select this function.

DELIMITER $$



CREATE FUNCTION emp_info(p_first_name varchar(255), p_last_name varchar(255)) RETURNS decimal(10,2)

DETERMINISTIC NO SQL READS SQL DATA

BEGIN

    DECLARE v_max_from_date date;

    DECLARE v_salary decimal(10,2);

SELECT 
    MAX(from_date)
INTO v_max_from_date FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.first_name = p_first_name
        AND e.last_name = p_last_name;

SELECT 
    s.salary
INTO v_salary FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.first_name = p_first_name
        AND e.last_name = p_last_name
        AND s.from_date = v_max_from_date;

RETURN v_salary;

END$$

DELIMITER ;

SELECT EMP_INFO('Aruna', 'Journel');

## triggers

In [ ]:
# Create a trigger that checks if the hire date of an employee is higher than the current date. If true, set this date to be the current date. Format the output appropriately (YY-MM-DD).

DELIMITER $$

CREATE TRIGGER trig_hire_date  

BEFORE INSERT ON employees

FOR EACH ROW  

BEGIN  

                IF NEW.hire_date > date_format(sysdate(), '%Y-%m-%d') THEN     

                                SET NEW.hire_date = date_format(sysdate(), '%Y-%m-%d');     

                END IF;  

END $$  

DELIMITER ;  

   

INSERT employees VALUES ('999904', '1970-01-31', 'John', 'Johnson', 'M', '2025-01-01');  

SELECT  

    *  

FROM  

    employees

ORDER BY emp_no DESC;

## indexes

In [ ]:
SELECT 
    *
FROM
    employees
WHERE
    hire_date > '2000-01-01'; 

## after creating index, the search will be quicker and more efficient

CREATE INDEX i_hire_date ON employees(hire_date); 


SELECT 
    *
FROM
    employees
WHERE
    hire_date > '2000-01-01';

In [ ]:
# composite indexes

SELECT 
    *
FROM
    employees
WHERE
    first_name > 'Georgi'
        AND last_name = 'Facello'; 

        
CREATE INDEX i_composite ON employees(first_name, last_name); 


SELECT 
    *
FROM
    employees
WHERE
    first_name > 'Georgi'
        AND last_name = 'Facello';

In [ ]:
# checking for indexes of a table in a database

SHOW INDEX FROM employees FROM employees;

In [ ]:
# Drop the ‘i_hire_date’ index.

ALTER TABLE employees

DROP INDEX i_hire_date;

# Select all records from the ‘salaries’ table of people whose salary is higher than $89,000 per annum.

## Then, create an index on the ‘salary’ column of that table, and check if it has sped up the search of the same SELECT statement.

SELECT 
    *
FROM
    salaries
WHERE
    salary > 89000;


CREATE INDEX i_salary ON salaries(salary);

SELECT 
    *
FROM
    salaries
WHERE
    salary > 89000;

## CASE

In [ ]:
# Similar to the exercises done in the lecture, obtain a result set containing the employee number, first name, and last name of all employees with a number higher than 109990. Create a fourth column in the query, indicating whether this employee is also a manager, according to the data provided in the dept_manager table, or a regular employee. 

SELECT 
    e.emp_no,
    e.first_name,
    e.last_name,
    CASE
        WHEN dm.emp_no IS NOT NULL THEN 'Manager'
        ELSE 'Employee'
    END AS is_manager
FROM
    employees e
        LEFT JOIN
    dept_manager dm ON dm.emp_no = e.emp_no
WHERE
    e.emp_no > 109990;

In [ ]:
# Extract a dataset containing the following information about the managers: employee number, first name, and last name. Add two columns at the end – one showing the difference between the maximum and minimum salary of that employee, and another one saying whether this salary raise was higher than $30,000 or NOT.

SELECT 
    dm.emp_no,
    e.first_name,
    e.last_name,
    MAX(s.salary) - MIN(s.salary) AS salary_difference,
    CASE
        WHEN MAX(s.salary) - MIN(s.salary) > 30000 THEN 'Salary was raised by more then $30,000'
        ELSE 'Salary was NOT raised by more then $30,000'
    END AS salary_raise
FROM
    dept_manager dm
        JOIN
    employees e ON e.emp_no = dm.emp_no
        JOIN
    salaries s ON s.emp_no = dm.emp_no
GROUP BY s.emp_no;

In [ ]:
# Extract the employee number, first name, and last name of the first 100 employees, and add a fourth column, called “current_employee” saying “Is still employed” if the employee is still working in the company, or “Not an employee anymore” if they aren’t.

## Hint: You’ll need to use data from both the ‘employees’ and the ‘dept_emp’ table to solve this exercise. 

SELECT 
    e.emp_no,
    e.first_name,
    e.last_name,
    CASE
        WHEN MAX(de.to_date) > SYSDATE() THEN 'Is still employed'
        ELSE 'Not an employee anymore'
    END AS current_employee
FROM
    employees e
        JOIN
    dept_emp de ON de.emp_no = e.emp_no
GROUP BY de.emp_no
LIMIT 100;

# UDEMY Practice SQL – 10 Final Query Questions

In [ ]:
# Exercise 1: Find the average salary of the male and female employees in each department.

In [ ]:
SELECT
    d.dept_name, e.gender, AVG(salary)
FROM
    salaries s
        JOIN
    employees e ON s.emp_no = e.emp_no
        JOIN
    dept_emp de ON e.emp_no = de.emp_no
        JOIN
    departments d ON d.dept_no = de.dept_no
GROUP BY de.dept_no , e.gender
ORDER BY de.dept_no;

In [ ]:
# Exercise 2: Find the lowest department number encountered in the 'dept_emp' table. Then, find the highest department number.

In [ ]:
SELECT
    MIN(dept_no)
FROM
    dept_emp;
    

SELECT
    MAX(dept_no)
FROM
    dept_emp;

In [ ]:
# Exercise 3: Obtain a table containing the following three fields for all individuals whose employee number is not greater than 10040:
# - employee number
# - the smallest department number among the departments where an employee has worked in (use a subquery to retrieve this value from the 'dept_emp' table)
# - assign '110022' as 'manager' to all individuals whose employee number is less than or equal to 10020, and '110039' to those whose number is between 10021 and 10040 inclusive (use a CASE statement to create the third field).
# If you've worked correctly, you should obtain an output containing 40 rows. 
# Here’s the top part of the output.

emp_no dept_no manager
10001   d005   110022

In [ ]:
SELECT
    e.emp_no,
    (SELECT
            MIN(de.dept_no)
        FROM
            dept_emp de
        WHERE
            e.emp_no = de.emp_no) dept_no,
    CASE
        WHEN emp_no <= 10020 THEN '110022'
        ELSE '110039'
    END AS manager
FROM
    employees e
WHERE
    emp_no <= 10040;

In [ ]:
SELECT 
    A.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110022) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no <= 10020
    GROUP BY e.emp_no
    ORDER BY e.emp_no) AS A 
UNION SELECT 
    B.*
FROM
    (SELECT 
        e.emp_no AS employee_ID,
            MIN(de.dept_no) AS department_code,
            (SELECT 
                    emp_no
                FROM
                    dept_manager
                WHERE
                    emp_no = 110039) AS manager_ID
    FROM
        employees e
    JOIN dept_emp de ON e.emp_no = de.emp_no
    WHERE
        e.emp_no > 10020
    GROUP BY e.emp_no
    ORDER BY e.emp_no
    LIMIT 20) AS B;

In [ ]:
SELECT 
    e.emp_no,
    e.first_name,
    e.last_name,
    CASE
        WHEN dm.emp_no IS NOT NULL THEN 'Manager'
        ELSE 'Employee'
    END AS is_manager
FROM
    employees e
        LEFT JOIN
    dept_manager dm ON dm.emp_no = e.emp_no
WHERE
    e.emp_no > 109990;

In [ ]:
# second solution

SELECT 
    emp_no,
    dept_no,
    CASE
        WHEN emp_no <= 10020 THEN '110022'
        ELSE '110039'
    END AS manager
FROM
    dept_emp
WHERE
    emp_no <= 10040
    
GROUP BY emp_no
ORDER BY emp_no;

In [ ]:
# Exercise 4: Retrieve a list with all employees that have been hired in the year 2000.

In [ ]:
SELECT
    *
FROM
    employees
WHERE
    YEAR(hire_date) = 2000;

In [ ]:
# Exercise 5: Retrieve a list with all employees from the ‘titles’ table who are engineers. 
# Repeat the exercise, this time retrieving a list with all employees from the ‘titles’ table who are senior engineers.

In [ ]:
SELECT
    *
FROM
    titles
WHERE
    title LIKE ('%engineer%');
    
    
SELECT
    *
FROM
    titles
WHERE
    title LIKE ('%senior engineer%');

In [ ]:
# Exercise 6
# Create a procedure that asks you to insert an employee number to obtain an output containing the same number, as well as the number and name of the last department the employee has worked for.
# Finally, call the procedure for employee number 10010.
# If you've worked correctly, you should see that employee number 10010 has worked for department number 6 - "Quality Management".

In [ ]:
DROP procedure IF EXISTS last_dept;

DELIMITER $$
CREATE PROCEDURE last_dept (in p_emp_no integer)
BEGIN
SELECT
    e.emp_no, d.dept_no, d.dept_name
FROM
    employees e
        JOIN
    dept_emp de ON e.emp_no = de.emp_no
        JOIN
    departments d ON de.dept_no = d.dept_no
WHERE
    e.emp_no = p_emp_no
        AND de.from_date = (SELECT
            MAX(from_date)
        FROM
            dept_emp
        WHERE
            emp_no = p_emp_no);
END$$
DELIMITER ;

call employees.last_dept(10010);

In [ ]:
# Exercise 7
# How many contracts have been registered in the ‘salaries’ table with duration of more than one year and of value higher than or equal to $100,000? 
# Hint: You may wish to compare the difference between the start and end date of the salaries contracts.

In [ ]:
SELECT 
    COUNT(*)
FROM
    salaries
WHERE
    salary >= 100000
        AND DATEDIFF(to_date, from_date) > 365;

In [ ]:
# Exercise 8
# Create a trigger that checks if the hire date of an employee is higher than the current date. If true, set this date to be the current date. Format the output appropriately (YY-MM-DD).
# Extra challenge: You may try to declare a new variable called 'today' which stores today's data, and then use it in your trigger!
# After creating the trigger, execute the following code to see if it's working properly.

In [ ]:
DROP TRIGGER IF EXISTS trig_hire_date;

DELIMITER $$
CREATE TRIGGER trig_hire_date
BEFORE INSERT ON employees
 
FOR EACH ROW
BEGIN 
    DECLARE today date;
    SELECT date_format(sysdate(), '%Y-%m-%d') INTO today;
 
	IF NEW.hire_date > today THEN
		SET NEW.hire_date = today;
	END IF;
END $$
 
DELIMITER ;

In [ ]:
# second solution

SET @v_today = date_format(sysdate(), '%Y-%m-%d');


DROP TRIGGER IF EXISTS hire_date;


DELIMITER $$ 
CREATE TRIGGER hire_date
BEFORE INSERT ON employees
FOR EACH ROW

BEGIN

	IF NEW.hire_date > @v_today THEN     

		SET NEW.hire_date = @v_today;     

	END IF;  

END $$  

DELIMITER ;  



INSERT employees VALUES ('999904', '1970-01-31', 'John', 'Johnson', 'M', '2025-01-01');  

SELECT 
    *
FROM
    employees
ORDER BY emp_no DESC;

In [ ]:
# Exercise 9
# Define a function that retrieves the largest contract salary value of an employee. Apply it to employee number 11356. 
# Also, what is the lowest salary value per contract of the same employee? You may want to create a new function that will deliver this number to you.  Apply it to employee number 11356 again.
# Feel free to apply the function to other employee numbers as well.

In [ ]:
DROP FUNCTION IF EXISTS f_highest_salary;

DELIMITER $$
CREATE FUNCTION f_highest_salary (p_emp_no INTEGER) RETURNS DECIMAL(10,2)
DETERMINISTIC
BEGIN

DECLARE v_highest_salary DECIMAL(10,2);

SELECT
    MAX(s.salary)
INTO v_highest_salary FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.emp_no = p_emp_no;

RETURN v_highest_salary;
END$$

DELIMITER ;


SELECT f_highest_salary(11356);




DROP FUNCTION IF EXISTS f_lowest_salary;

DELIMITER $$
CREATE FUNCTION f_lowest_salary (p_emp_no INTEGER) RETURNS DECIMAL(10,2)
DETERMINISTIC
BEGIN

DECLARE v_lowest_salary DECIMAL(10,2);

SELECT
    MIN(s.salary)
INTO v_lowest_salary FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.emp_no = p_emp_no;

RETURN v_lowest_salary;
END$$

DELIMITER ;


SELECT f_lowest_salary(10356);

In [ ]:
# Second Solution 
DROP FUNCTION IF EXISTS largest_salary; 

DELIMITER $$

CREATE FUNCTION largest_salary(p_emp_no INT) RETURNS decimal(10,2)

DETERMINISTIC NO SQL READS SQL DATA

BEGIN

    DECLARE v_max_salary decimal(10,2);

SELECT 
    MAX(salary)
INTO v_max_salary FROM
    salaries s
WHERE
    s.emp_no = p_emp_no;

RETURN v_max_salary;

END$$

DELIMITER ;

SELECT LARGEST_SALARY(11356);

In [ ]:
# Exercise 10
# Based on the previous example, you can now try to create a function that accepts also a second parameter which would be a character sequence. 
# Evaluate if its value is 'min' or 'max' and based on that retrieve either the lowest or the highest salary (using the same logic and code 
# from Exercise 9). If this value is a string value different from ‘min’ or ‘max’, then the output of the function should return 
# the difference between the highest and the lowest salary.

In [ ]:
DROP FUNCTION IF EXISTS f_salary;

DELIMITER $$
CREATE FUNCTION f_salary (p_emp_no INTEGER, p_min_or_max varchar(10)) RETURNS DECIMAL(10,2)
DETERMINISTIC
BEGIN

DECLARE v_salary_info DECIMAL(10,2);

SELECT
    CASE
        WHEN p_min_or_max = 'max' THEN MAX(s.salary)
        WHEN p_min_or_max = 'min' THEN MIN(s.salary)
        ELSE MAX(s.salary) - MIN(s.salary)
    END AS salary_info
INTO v_salary_info FROM
    employees e
        JOIN
    salaries s ON e.emp_no = s.emp_no
WHERE
    e.emp_no = p_emp_no;

RETURN v_salary_info;
END$$

DELIMITER ;

select employees.f_salary(11356, 'min');
select employees.f_salary(11356, 'max');
select employees.f_salary(11356, 'maxxx');

# SPRINGBOARD PRACTICE QUESTIONS

In [ ]:
/* Welcome to the SQL mini project. For this project, you will use
Springboard' online SQL platform, which you can log into through the
following link:

https://sql.springboard.com/
Username: student
Password: learn_sql@springboard

The data you need is in the "country_club" database. This database
contains 3 tables:
    i) the "Bookings" table,
    ii) the "Facilities" table, and
    iii) the "Members" table.

Note that, if you need to, you can also download these tables locally.

In the mini project, you'll be asked a series of questions. You can
solve them using the platform, but for the final deliverable,
paste the code for each solution into this script, and upload it
to your GitHub.

Before starting with the questions, feel free to take your time,
exploring the data, and getting acquainted with the 3 tables. */



/* Q1: Some of the facilities charge a fee to members, but some do not.
Please list the names of the facilities that do. */


SELECT 
    name
FROM
    facilities
WHERE
    membercost = 0;

In [ ]:
/* Q2: How many facilities do not charge a fee to members? */

SELECT 
    COUNT(name)
FROM
    facilities
WHERE
    membercost = 0;

In [ ]:
/* Q3: How can you produce a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost?
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question. */

SELECT 
    facid, name AS facility_name, membercost, monthlymaintenance
FROM
    facilities
WHERE
    membercost < monthlymaintenance * .2
        AND membercost != 0;

In [ ]:
/* Q4: How can you retrieve the details of facilities with ID 1 and 5?
Write the query without using the OR operator. */

SELECT 
    *
FROM
    facilities
WHERE
    facid IN (1 , 5);

In [ ]:
/* Q5: How can you produce a list of facilities, with each labelled as
'cheap' or 'expensive', depending on if their monthly maintenance cost is
more than $100? Return the name and monthly maintenance of the facilities
in question. */

SELECT 
    name,
    monthlymaintenance,
    CASE
        WHEN monthlymaintenance > 100 THEN 'expensive'
        ELSE 'cheap'
    END AS price
FROM
    facilities;

In [ ]:
/* Q6: You'd like to get the first and last name of the last member(s)
who signed up. Do not use the LIMIT clause for your solution. */

SELECT 
    firstname, surname
FROM
    members
WHERE
    joindate = (SELECT 
            MAX(joindate)
        FROM
            members)
;

In [ ]:
/* Q7: How can you produce a list of all members who have used a tennis court?
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */

SELECT 
    CONCAT(m.firstname, ' ', m.surname) AS member_ID, f.name AS facility_name
FROM
    members m
        JOIN
    bookings b ON m.memid = b.memid
        JOIN
    facilities f ON b.facid = f.facid
WHERE
    f.name LIKE '%Tennis Court%'
    
GROUP BY member_ID
ORDER BY member_ID; 


# Alternatively, especially for duplicate values using SELECT DISTINCT 

SELECT DISTINCT
    (CONCAT(m.firstname, ' ', m.surname)) AS member, f.name
FROM
    facilities f
        JOIN
    Bookings b ON f.facid = b.facid
        JOIN
    Members m ON m.memid = b.memid AND m.memid != 0
WHERE
    f.name LIKE '%Tennis Court%'
ORDER BY member;

In [ ]:
/* Q8: How can you produce a list of bookings on the day of 2012-09-14 which
will cost the member (or guest) more than $30? Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */

SELECT 
    f.name AS facility_name,
    CONCAT(m.firstname, ' ', m.surname) AS member_ID,
    CASE
        WHEN m.memid != 0 THEN b.slots * f.membercost
        WHEN m.memid = 0 THEN b.slots * f.guestcost
    END AS cost
FROM
    members m
        JOIN
    bookings b ON m.memid = b.memid
        JOIN
    facilities AS f ON b.facid = f.facid
WHERE
    b.starttime >= '2012-09-14'
        AND b.starttime < '2012-09-15'
        AND ((m.memid != 0
        AND b.slots * f.membercost > 30)
        OR (m.memid = 0
        AND b.slots * f.guestcost > 30))
ORDER BY cost DESC;

In [ ]:

/* Q9: This time, produce the same result as in Q8, but using a subquery. */

SELECT 
    sub.name AS facility_name,
    sub.member AS member_ID,
    sub.cost AS cost
FROM
    (SELECT 
        CONCAT(m.firstname, ' ', m.surname) AS member,
            f.name,
            CASE
                WHEN m.memid != 0 THEN b.slots * f.membercost
                WHEN m.memid = 0 THEN b.slots * f.guestcost
            END AS cost
    FROM
        members m
    JOIN bookings b ON m.memid = b.memid
    JOIN facilities f ON b.facid = f.facid
    WHERE
        b.starttime >= '2012-09-14'
            AND b.starttime < '2012-09-15'
    HAVING cost > 30) AS sub
ORDER BY cost DESC;

In [ ]:
/* Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members! */

SELECT 
    facility_name, revenue AS total_revenue
FROM
    (SELECT 
        SUM(CASE
                WHEN b.memid != 0 THEN b.slots * f.membercost
                WHEN b.memid = 0 THEN b.slots * f.guestcost
            END) AS revenue,
            f.name AS facility_name
    FROM
        bookings b
    JOIN facilities f ON b.facid = f.facid
    GROUP BY f.name
    HAVING revenue < 1000) AS sub
ORDER BY revenue;